bigjosh/TSL-calibre-MSP/CCS Project/msp430fr413x_LCDE_03.c/tsl-calibre-msp.cpp
    // Now that CLKOUT is disabled on the RV3032, it is supposed to be driven low, but seems to float sometimes
    // so lets pull it low on the MSP430 to prevent float leakage.
    CBI( RV3032_CLKOUT_POUT , RV3032_CLKOUT_B );
    SBI( RV3032_CLKOUT_PREN , RV3032_CLKOUT_B );


    // Periodic Timer value = 2048 for 500ms

    const unsigned timerValue = 2048;
    uint8_t timerValueH = timerValue / 0x100;
    uint8_t timerValueL = timerValue % 0x100;
    i2c_write( RV_3032_I2C_ADDR , 0x0b , &timerValueL  , 1 );
    i2c_write( RV_3032_I2C_ADDR , 0x0c , &timerValueH  , 1 );

    // Set TIE in Control 2 to 1 t enable interrupt pin for periodic countdown
    uint8_t control2_reg = 0b00010000;
    i2c_write( RV_3032_I2C_ADDR , 0x11 , &control2_reg , 1 );

    // set TD to 00 for 4068Hz timer, TE=1 to enable periodic countdown timer, EERD=1 to disable automatic EEPROM refresh (why would you want that?). Bit 5 not used but must be set to 1.
    uint8_t control1_reg = 0b00011100;
    i2c_write( RV_3032_I2C_ADDR , 0x10 , &control1_reg , 1 );

    // OK, we will now get a 122uS low pulse on INT every 500ms.


    // Next check if the RV3032 just powered up, or if it was already running and show a 1 in digit 10 if it was running (0 if not)
    uint8_t status_reg=0xff;
    i2c_read( RV_3032_I2C_ADDR , 0x0d , &status_reg , 1 );

    if ( (status_reg & 0x03) == 0 ) {               //If power on reset or low voltage drop detected then we have not been running continuously

        // RESET or errormessage here

    }
    status_reg =0x00;   // Clear all flags for next time we check
    i2c_write( RV_3032_I2C_ADDR , 0x0d , &status_reg , 1 );


    // Next check if the RV3032 just powered up, or if it was already running and show a 1 in digit 10 if it was running (0 if not)
    uint8_t sec_reg=0xff;
    i2c_read( RV_3032_I2C_ADDR , 0x01 , &sec_reg , 1 );

    /*
    lcd_show_f( 11 , sec_reg / 0x10  );
    lcd_show_f( 10 , sec_reg & 0x0f );
    */

    i2c_write( RV_3032_I2C_ADDR , 0x01 , &sec_reg , 1 );


    // We are done setting stuff up with the i2c connection, so drive the pins low
    // This will hopefully reduce leakage and also keep them from floating into the
    // RV3032 when the MSP430 looses power during a battery change.

    i2c_shutdown();



    // TODO: Why doesn't this work?
    //LCDMEMCTL |= LCDCLRM;                               // Clear LCD memory command (executed one shot)
    //while (LCDMEMCTL & LCDCLRM);                        // Wait for clear to complete before moving on
/*
    lcd_show< 0,0>();
    lcd_show< 1,1>();
    lcd_show< 2,2>();
    lcd_show< 3,3>();
    lcd_show< 4,4>();
    lcd_show< 5,5>();
    lcd_show< 6,6>();
    lcd_show< 7,7>();
    lcd_show< 8,8>();
    lcd_show< 9,9>();
    lcd_show<10,0>();
    lcd_show<11,1>();
*/

    /*
    unsigned f = PMMIFG;        // Read reset flags

    if (f & PMMLPM5IFG) {       // Wake from LPMx.5
        lcd_show< 7,1>();
    }


    if (f & SVSHIFG) {          // SVS low side interrupt flag (power up)
        lcd_show< 6,1>();
    }


    if (f & PMMPORIFG) {
        lcd_show< 5,1>();
    }

    if (f & PMMPORIFG) {
        lcd_show< 4,1>();
    }

    if (f & PMMRSTIFG) {            // Reset pin
          lcd_show< 3,1>();
      }


    if (f & PMMBORIFG) {
          lcd_show< 2,1>();
    }


    SYSRSTIV = 0x00;
    unsigned iv = SYSRSTIV;

    if (iv!=0x0000) {
        lcd_show< 8,1>();
    }

    */

    //Enter LPM3 with SVS off
    //PMMCTL0_L &= ~SVSHE ;                           // disable SVS (prob ~0.2uA, default is on)
    //TODO:Turn off LPM3.5 switch before sleeping? //LPM5SW

    // Datasheet says this will be 1.25uA with LCD...
    // Low-power mode 3, VLO, excludes SVS test conditions:
    // Current for watchdog timer clocked by VLO included. RTC disabled. Current for brownout included. SVS disabled (SVSHE = 0).
    // CPUOFF = 1, SCG0 = 1 SCG1 = 1, OSCOFF = 0 (LPM3),

    // "the WDTHOLD bit can be used to hold the WDTCNT, reducing power consumption."


    //WDTCTL = WDTPW | WDTSSEL__VLO | WDTHOLD;                               // Select VLO for WDT clock, halt watchdog timer


    // "After reset, RTCSS defaults to 00b (disabled), which means that no clock source is selected."



/*
    // Disabling the System Voltage Supervisor is supposed to save us about 2uA, but no effect found in testing. If anything, seems to add about 0.01uA.

    PMMCTL0_H = PMMPW_H;            // Open PMM Registers for write
    CBI( PMMCTL0_L  , SVSHE ) ;     // 0b = High-side SVS (SVSH) is disabled in LPM2, LPM3, LPM4, LPM3.5, and LPM4.5 (prob ~0.2uA, default is on)

*/


    // TODO: Try switching MCLK to VLO. We will run really slow.... but maybe save power?
    // CSCTL4 = SELMS__VLOCLK;
    // Nope, uses MORE power 4.5uA vs 2.3uA. Maybe the FLO clock is still running?



    // Go into ready to launch mode (Show squiggles until trigger pin pulled)
    mode = READY_TO_LAUNCH;


    // Clear any pending interrupts from the INT or trigger pins
    //CBI( RV3032_INT_PIFG , RV3032_CLKOUT_B );

    CBI( RV3032_INT_PIFG     , RV3032_INT_B    );
    CBI( TRIGGER_SWITCH_PIFG , TRGIGER_SWITCH_B);

    if (!TBI(TRGIGER_SWITCH_PIN,TRGIGER_SWITCH_B)) {

        // Trigger pin not inserted

        mode = UNARMED;

    } else {

        // Trigger pin inserted

        mode = READY_TO_LAUNCH;


    }


    __bis_SR_register( LPM4_bits | GIE );                    // Enter LPM4 - 2.12uA with static @ Vcc=3.5V, 2.2uA with simple counting

/*
    The LMPx.5 modes are very not worth it for us since they waste so much power on extended wake up time.
    They would only be worth it if you were sleeping >minutes, not 500ms like we are.

*/
/*
    SBI( DEBUGA_POUT , DEBUGA_B );


    // Go into LPMx.5 sleep
    PMMCTL0_H = PMMPW_H;                               // Open PMM Registers for write
    PMMCTL0_L |= PMMREGOFF_L;                           // and set PMMREGOFF also clears SVS
    // TODO: datasheets say SVS off makes wakeup 10x slower, so need to test when wake works

//        __bis_SR_register( LPM3_bits | GIE );                    // Enter LPM3.5 - 1.87uA with static @ Vcc=3.5V, , 4.8uA with simple counting
//        __bis_SR_register( LPM4_bits | GIE );                    // Enter LPM4.5 - 1.87uA with static @ Vcc=3.5V, 4.5uA with simple counting

*/
    /*
    PMMCTL0_H = PMMPW_H;                                // Open PMM Registers for write
    PMMCTL0_L = PMMREGOFF_L | SVSHE;                   // and set PMMREGOFF (go into a x.5 mode on next sleep) and disable low voltage monitor

    __bis_SR_register(LPM3_bits | GIE);                 // Enter LPM3.5
    __no_operation();                                   // For debugger
     */

    while (1) {

