bigjosh/TSL-calibre-MSP/CCS Project/msp430fr413x_LCDE_03.c/tsl-calibre-msp.cpp
        lcd_show< 9,2>();
        __delay_cycles(1000000);
        lcd_show< 9,3>();
        __delay_cycles(1000000);

    }

}


#pragma vector = PORT1_VECTOR

__interrupt void PORT1_ISR(void) {

    // Wake time measured at 48us
    // TODO: Make sure there are no avoidable push/pops happening at ISR entry (seems too long)

    // TODO: Disable pull-up while in ISR


    SBI( DEBUGA_POUT , DEBUGA_B );      // See latency to start ISR and how long it runs

    if (mode == TIME_SINCE_LAUNCH) {

        if (!halfsec) {

            halfsec=1;

        } else {

            // Show current time

            halfsec = 0;

            secs++;

            if (secs == 60) {

                secs=0;

                mins++;

                if (mins==60) {

                    mins = 0;

                    hours++;

                    if (hours==24) {

                        hours = 0;

                        if (days=999999) {

                            for( char i=0 ; i<LOGICAL_DIGITS_SIZE; i++ ) {

                                // The long now

                                lcd_show_f( i , x_segments );           // TODO: Think of something better to show here.
                                                                        // TODO: Add a "long now" indicator on the LCD

                            }



                        } else {

                            days++;

                            lcd_show_f(  6 , digit_segments[ (days / 1      ) % 10 ] );
                            lcd_show_f(  7 , digit_segments[ (days / 10     ) % 10 ] );
                            lcd_show_f(  8 , digit_segments[ (days / 100    ) % 10 ] );
                            lcd_show_f(  9 , digit_segments[ (days / 1000   ) % 10 ] );
                            lcd_show_f( 10 , digit_segments[ (days / 10000  ) % 10 ] );
                            lcd_show_f( 11 , digit_segments[ (days / 100000 ) % 10 ] );

                        }


                    }

                    lcd_show_f( 4 , digit_segments[ hours % 10 ] );
                    lcd_show_f( 5 , digit_segments[ hours / 10 ] );

                }

                lcd_show_f( 2 , digit_segments[ mins % 10 ] );
                lcd_show_f( 3 , digit_segments[ mins / 10 ] );

            }


            lcd_show_f( 0 , digit_segments[ secs % 10 ] );
            lcd_show_f( 1 , digit_segments[ secs / 10 ] );


        }


    } else if ( mode==READY_TO_LAUNCH ) {

        // Check if trigger pin pulled (low)


        if ( !TBI( TRGIGER_SWITCH_PIN , TRGIGER_SWITCH_B ) ) {

            // WE HAVE LIFTOFF!

            // We need to get everything below done withing 0.5 seconds so we do not miss the first tick.

            // Disable the trigger pin and drive low to save power and prevent any more interrupts from it

            CBI( TRGIGER_SWITCH_POUT , TRGIGER_SWITCH_B );      // low
            SBI( TRGIGER_SWITCH_PDIR , TRGIGER_SWITCH_B );      // drive

            for( char i=0 ; i<LOGICAL_DIGITS_SIZE; i++ ) {

                lcd_show_f( i , digit_segments[0] );

            }


            // Start counting from now. We will get the first tick in 500ms

            restart_rv3032_periodic_timer();

            // Flash lights

            flash();

            // Record timestamp

            // Clear any interrupt that raced and got in while we were doing all of the above.
            // Note that the flash takes >122uS so we are assured that no additional extra interrupt can happen between when we reset the timer and now.

            CBI( TRIGGER_SWITCH_PIFG , TRGIGER_SWITCH_B );      // Clear the pending trigger pin interrupt flag (should never get another now that pin is driven low)

            mode = TIME_SINCE_LAUNCH;


        } else {

            char current_squiggle_step = next_squiggle_step;

            for( char i=0 ; i<LOGICAL_DIGITS_SIZE; i++ ) {

                lcd_show_f( i , squiggle_segments[ current_squiggle_step ]);

                if ( current_squiggle_step == 0 ) {
                    current_squiggle_step = SQUIGGLE_SEGMENTS_SIZE-1;
                } else {
                    current_squiggle_step--;
                }

            }


            if ( next_squiggle_step == 0 ) {
                next_squiggle_step = SQUIGGLE_SEGMENTS_SIZE-1;
            } else {
                next_squiggle_step--;
            }
        }
    } else if ( mode==ARMING ) {

        // Do nothing, this is just to add a delay between when the pin is inserted and when we are armed and ready to lanuch

        // We are currently showing dashes, and we will switch to squiggles on next tick

        mode = READY_TO_LAUNCH;

        CBI( TRIGGER_SWITCH_PIFG , TRGIGER_SWITCH_B );      // Clear the pending trigger pin interrupt flag (should never get another now that pin is driven low)


    } else { // mode==UNARMED

        // Check if pin was inserted (pin high)

        CBI( TRIGGER_SWITCH_PIFG , TRGIGER_SWITCH_B );      // Clear pending interrupt flag

        if ( TBI( TRGIGER_SWITCH_PIN , TRGIGER_SWITCH_B ) ) {

            // Show a little full dash screen to indicate that we know you put the pin in

              for( char i=0 ; i<LOGICAL_DIGITS_SIZE; i++ ) {

                  lcd_show_f( i , dash_segments );

              }


              //Start showing the ready to launch squiggles on next tick

              mode = ARMING;

              // note that here we wait a full tick before checking that it is out again. This will debounce the switch for 05.s when the pin is inserted.

        } else {

            // trigger pin still out
            // show a little dash sliding towards the trigger pin

            char current_dash_step = next_dash_step;

            if (next_dash_step==0) {

                next_dash_step = LOGICAL_DIGITS_SIZE-1;

            } else {

                next_dash_step--;

            }


            for( char i=0 ; i<LOGICAL_DIGITS_SIZE; i++ ) {


                if (i==current_dash_step || i==next_dash_step ) {
                    lcd_show_f( i , dash_segments );
                } else {
                    lcd_show_f( i , blank_segments );
                }

            }

        }

    }


    CBI( RV3032_INT_PIFG , RV3032_INT_B );      // Clear RV3032 INT pending interrupt flag

    CBI( DEBUGA_POUT , DEBUGA_B );

}


#pragma vector = RTC_VECTOR

__interrupt void RTC_ISR(void) {

    lcd_show< 9,1>();

    SBI( DEBUGA_POUT , DEBUGA_B );

    // Currently we never make it here in LPM3.5

    //RTCIV;
    //__no_operation();                                   // For debugger


    //(LCDMEM[pos4])++;//= digit[4];

    /*

    (LCDMEM[pos2])= digit[1];


    PMMCTL0_H = PMMPW_H;                                // Open PMM Registers for write
    PMMCTL0_L |= PMMREGOFF_L;                           // and set PMMREGOFF
    __bis_SR_register(LPM3_bits | GIE);                 // Re-enter LPM3.5

    (LCDMEM[pos2])= digit[6];

    */

    /*

    Inc_RTC();

    (LCDMEM[pos4]) = digit[4];

    PMMCTL0_H = PMMPW_H;                                // Open PMM Registers for write
    PMMCTL0_L |= PMMREGOFF_L;                           // and set PMMREGOFF
    __bis_SR_register(LPM3_bits | GIE);                 // Re-enter LPM3.5
*/

    CBI( DEBUGA_POUT , DEBUGA_B );

}

